class TaskClass
    #################################################################################
    # 登録フェーズに実行
    #################################################################################
    def register()
        raise("Not been implemented [run] methods.")
    end

    #################################################################################
    # 検証フェーズに実行するメソッド定義
    # 指定した名前の Task を返す
    # 該当する Task のオブジェクトが存在しない場合は例外を発生させる
    #################################################################################
    def linking()
        raise("Not been implemented [linking] methods.")
    end

    def getInstance(name)
        raise("Not been implemented [getInstance] methods.")
    end

    #################################################################################
    # 適用フェーズに実行
    #################################################################################
    def adapt()
        raise("Not been implemented [adapt] methods.")
    end
end